# Analyze Data

#### Note: These notebooks follow the Businness Analytics Scholarship Program from Udemy and Bertelsmann curriculum, originally intended for use with spreadsheet software, I decided to keep the curriculum in the original order, so some topics will feel out of place when translated for use with Pandas.

## Aggregate functions

Aggregate functions are functions that act over a range of data and return just a single value, for example the `SUM` function in Excel or SQL. They allows us to perform operations over several rows of our DataFrame.

Other examples include `mean`, `max`, `min`, `std` and `median`.

We can use these functions to operate or extract data from a column.

In [2]:
# As always we first import Pandas and load our dataset and check our data properties.
import pandas as pd
pokemon = pd.read_csv('datasets/pokemon.csv')
pokemon.head()

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,4,Mega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,5,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

In [29]:
# We use aggregate function methods on the Speed column
avg_speed = pokemon.Speed.mean()
max_speed = pokemon.Speed.max()
min_speed = pokemon.Speed.min()
# std stands for standard deviation
std_speed = pokemon.Speed.std()
med_speed = pokemon.Speed.median()

# Let's see how far are the mean and median from each other, formatting for the median is only provided for consistency
f'The average speed is {avg_speed:.2f} and the median speed is {med_speed:.2f}'

'The average speed is 68.28 and the median speed is 65.00'

## Logical Functions

### IF

`if` allows us to return different outputs depending on a condition, these conditions are made with comparison operators.

### Comparison Operators (>,<,==,>=,>=, !=)

These comparison operators compare values and they return a boolean value, `True` or `False`.
* `>` greater than
* `<` less than
* `==` equal
* `>=` greater than or equal to
* `<=` less than or equal to
* `!=` not equal

Logical functions are used to filter data or create new columns (as we covered in the last section of the  *spreadsheets_2_manipulate_data notebook*), like in the last example where we selected Pokemons that are legendary with a Speed value greater than 100.

```python
pokemon[(pokemon_legendaries.Legendary == True) & (pokemon_legendaries.Speed > 100)]
```

Note that there is an IF implied in the declaration, **IF** the Legendary column *equals* `True` **AND** the `Speed` value is *greater* than 100, then show me those Pokemons.

In [32]:
pokemon[(pokemon.Legendary == True) & (pokemon.Speed > 100)].head()

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
162,163,Mewtwo,Psychic,NaN,106,110,90,154,90,130,1,True
163,164,Mega Mewtwo X,Psychic,Fighting,106,190,100,154,100,130,1,True
164,165,Mega Mewtwo Y,Psychic,NaN,106,150,70,194,120,140,1,True
262,263,Raikou,Electric,NaN,90,85,75,115,100,115,2,True
269,270,Lugia,Psychic,Flying,106,90,130,90,154,110,2,True

### Logical Functions (AND, OR, NOT)

These functions help us to combine more than one condition, in the last example we used **AND**, `and` returns values only when all conditions are true, while `OR` will return if **any** of the conditions is true, let's say you want to know how many Pokemons of type Dragon are there we could run a filter on column `Type 1` but some pokemons have two types, so we need to run the filter on `Type 2` too because maybe the Dragon type in specified on `Type 2`.

In Pandas we use `|` to indicate the **OR** operator

In [38]:
pokemon[(pokemon['Type 1'] == 'Dragon') | (pokemon['Type 2'] == 'Dragon')].head(10)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
7,8,Mega Charizard X,Fire,Dragon,78,130,111,130,85,100,1,False
159,160,Dratini,Dragon,NaN,41,64,45,50,50,50,1,False
160,161,Dragonair,Dragon,NaN,61,84,65,70,70,70,1,False
161,162,Dragonite,Dragon,Flying,91,134,95,100,100,80,1,False
196,197,Mega Ampharos,Electric,Dragon,90,95,105,165,110,45,2,False
249,250,Kingdra,Water,Dragon,75,95,95,95,95,85,2,False
275,276,Mega Sceptile,Grass,Dragon,70,110,75,145,85,145,3,False
360,361,Vibrava,Ground,Dragon,50,70,50,50,50,70,3,False
361,362,Flygon,Ground,Dragon,80,100,80,80,80,100,3,False
365,366,Altaria,Dragon,Flying,75,70,90,70,105,80,3,False

Maybe your older sibling picked Charizard first and now you have some issues with Dragons, so you only want to know what pokemons **ARE NOT** Dragon type.

We will use the **NOT** operator which reverses our selection (it gives us its complement), in Pandas **NOT** is represented by `~`.

We will need to group both conditions between parenthesis () to apply `~` to them at the same time.

In [42]:
pokemon[~((pokemon['Type 1'] == 'Dragon') | (pokemon['Type 2'] == 'Dragon'))]

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,4,Mega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,5,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,796,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,797,Mega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,798,Hoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,799,Hoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,800,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

## Conditional Aggregation Functions

Pandas doesn't have a native COUNTIF or SUMIF equivalent, however we can combine functions, conditions and operators to perform them like we did in the previous example.

However, there's a method that can help us with SUMIF, which is `.groupby()`.

Let's say you have a operate a delivery service and have the following dataframe:

In [3]:
deli = pd.DataFrame({'Driver': ['a','a','b','b','c','c'],
                     'Number of deliveries': [3,5,8,3,8,12],
                     'Number of pick-ups': [7,9,7,5,5,6]})
deli

  Driver  Number of deliveries  Number of pick-ups
0      a                     3                   7
1      a                     5                   9
2      b                     8                   7
3      b                     3                   5
4      c                     8                   5
5      c                    12                   6

In [4]:
# We're going to perform a SUMIF on the number of deliveries and group them by Driver
deli.groupby('Driver')['Number of deliveries'].sum()

Driver
a     8
b    11
c    20
Name: Number of deliveries, dtype: int64

Now we know that driver C has the most deliveries.

### VLOOKUP or merge()

This is one of the most useful functions in excel, it allows us to find data on two sheets or in Pandas case, two dataframes.

`merge()` will allow us to merge two dataframes that share at least one common column.

I will only show how to do an 'inner' join, which is the most commonly used one, as you see the `merge()` method works like `JOIN` in SQL.

In [15]:
employees = pd.read_csv('datasets/employees.csv')
clients = pd.read_csv('datasets/clients.csv')
employees.head()

                name  employee ID Office location
0  Josefina Madrigal            1     Mexico City
1     Jotaro Johnson            2       San Diego
2   Joseline Chisaka            3       San Diego
3       Jorge Issawi            4           Tokyo
4          Joe Dalal            5          London

In [16]:
clients.head()

   employee ID  Deals closed    Biggest Client
0            1            14              ACME
1            2            18          Wayne CO
2            3            17     S.T.A.R. Labs
3            4            15  Aperture Science
4            5            18  Stark Industries

In [17]:
# Now we will merge them
new_df = pd.merge(employees, clients, on='employee ID', how = 'inner')
new_df.head()

,name,employee ID,Office location,Deals closed,Biggest Client
0,Josefina Madrigal,1,Mexico City,14,ACME
1,Jotaro Johnson,2,San Diego,18,Wayne CO
2,Joseline Chisaka,3,San Diego,17,S.T.A.R. Labs
3,Jorge Issawi,4,Tokyo,15,Aperture Science
4,Joe Dalal,5,London,18,Stark Industries

This is it for the basics of analyze data, until now we have only make operations on numeric data and dataframes, but sometimes our colleagues or clients will prefer something more visual, in the next notebook we will see the basics of Data Visualization.